Revit 2018 API
Asset Members
The Asset type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from AssetProperty.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAllConnectedProperties
 Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
 (Inherited from AssetProperty.)
GetConnectedPropertiesNames
 Gets names of all connected properties.
 (Inherited from AssetProperty.)
GetConnectedProperty(Int32)
 Gets one connected property with specified index.
 (Inherited from AssetProperty.)
GetConnectedProperty(String)
 Gets a connected property by its name.
 (Inherited from AssetProperty.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AssetType
 The type of RenderingAsset
IsReadOnly
 Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified.
 (Inherited from AssetProperty.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from AssetProperty.)
Item[Int32] |  (Inherited from AssetProperties.)
Item[String] |  (Inherited from AssetProperties.)
LibraryName
 Library name
Name
Get the name of the AssetProperty
 (Inherited from AssetProperty.)
NumberOfConnectedProperties
 The number of currently connected properties.
 (Inherited from AssetProperty.)
Size
Gets the number of the AssetProperty(s) in the object.
 (Inherited from AssetProperties.)
Title
 Asset title
Type
Returns the type of the AssetProperty
 (Inherited from AssetProperty.)
See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace